; domain
(define
	(domain merry)
	(:requirements :adl)
	(:types hobbit ball room kolor box number)
	(:constants czerwony niebieski zolty rozowy zielony - kolor box1 box2 box3 box4 box5 box6 box7 box8 box9 - box num1 num2 num3 num4 num5 num6 num7 num8 pusty - number)
	
	(:predicates
		(at ?x ?r)
		(have ?b)
		(door ?r1 ?r2 - room ?k - kolor)
		(exit ?r - room)
		(color ?b - ball ?k - kolor)
		
		(puzzle ?r - room)
		(solved ?r - room)
		(adjacent ?b1 ?b2 - box)
		(numbered ?b - box ?n - number) 
	)
	
	(:action idz
		:parameters (?h - hobbit ?r1 ?r2 - room ?b - ball)
		:precondition
			(and
				(at ?h ?r1)
				(exists (?k - kolor) (and (have ?b) (color ?b ?k) (door ?r1 ?r2 ?k) ) )
			)
		:effect
			(and
				(not (at ?h ?r1))
				(not (have ?b))
				(at ?h ?r2)
			)
	)
	(:action wez
		:parameters (?h - hobbit ?r1 - room ?b - ball)
		:precondition
			(and
				(at ?h ?r1)
				(at ?b ?r1)
			)
		:effect
			(and
				(not (at ?b ?r1))
				(have ?b)
			)
		)
	(:action rozwiaz
		:parameters (?h - hobbit ?r - room)
		:precondition
			(and
				(at ?h ?r)
				(puzzle ?r)
				(numbered box1 num1)
				(numbered box2 num2)
				(numbered box3 num3)
				(numbered box4 num4)
				(numbered box5 num5)
				(numbered box6 num6)
				(numbered box7 num7)
				(numbered box8 num8)
				(numbered box9 pusty)
				
			)
		:effect
			(and
				(solved ?r)
				(not (puzzle ?r))
			)
	)
	(:action ruszKlocek
		:parameters (?h - hobbit ?r - room ?b1 ?b2 - box ?nm1 - number)
		:precondition
			(and
				(at ?h ?r)
				(puzzle ?r)
				(numbered ?b1 ?nm1)
				(numbered ?b2 pusty)
				(adjacent ?b1 ?b2)		
			)
		:effect
			(and
				(not(numbered ?b1 ?nm1))
				(not(numbered ?b2 pusty))
				(numbered ?b1 pusty)
				(numbered ?b2 ?nm1)
			)
	)
)

; problem
(define (problem p1)
	(:domain merry)
	(:objects z1 r2 z3 n4 z5 c6 n7 z8 n9 n10 z11 c12 z13 n14 - ball A B C D E F G H I - room hob - hobbit)
	(:init
		(at hob F)
		(color z1 zielony)
		(at z1 A)
		(color r2 rozowy)
		(at r2 B)
		(color z3 zolty)
		(at z3 C)
		(color n4 niebieski)
		(at n4 C)
		(color z5 zielony)
		(at z5 D)
		(color c6 czerwony)
		(at c6 D)
		(color n7 niebieski)
		(at n7 E)
		(color z8 zielony)
		(at z8 E)
		(color n9 niebieski)
		(at n9 F)
		(color n10 niebieski)
		(at n10 F)
		(color z11 zielony)
		(at z11 H)
		(color c12 czerwony)
		(at c12 H)
		(color z13 zolty)
		(at z13 I)
		(color n14 niebieski)
		(at n14 I)
		
		(door A B zolty)
		(door A C czerwony)
		(door C A czerwony)
		(door B D zolty)
		(door C E zielony)
		(door E C zielony)
		(door D F zielony)
		(door F D zielony)
		(door E F niebieski)
		(door F E niebieski)
		(door F G rozowy)
		(door E H czerwony)
		(door H E czerwony)
		(door F I niebieski)
		(door I F niebieski)
		(door H I niebieski)
		(door I H niebieski)
		
		(puzzle A)
		(adjacent box1 box2)
		(adjacent box2 box1)
		(adjacent box1 box4)
		(adjacent box4 box1)
		(adjacent box2 box3)
		(adjacent box3 box2)
		(adjacent box2 box5)
		(adjacent box5 box2)
		(adjacent box3 box6)
		(adjacent box6 box3)
		
		(adjacent box4 box5)
		(adjacent box5 box4)
		(adjacent box4 box7)
		(adjacent box7 box4)
		(adjacent box5 box6)
		(adjacent box6 box5)
		(adjacent box5 box8)
		(adjacent box8 box5)
		(adjacent box6 box9)
		(adjacent box9 box6)
		
		(adjacent box7 box8)
		(adjacent box8 box7)
		(adjacent box8 box9)
		(adjacent box9 box8)
		
		
		(numbered box1 num5)
		(numbered box2 num4)
		(numbered box3 num1)
		(numbered box4 num8)
		(numbered box5 pusty)
		(numbered box6 num3)
		(numbered box7 num7)
		(numbered box8 num2)
		(numbered box9 num6)
		
		)
	
	(:goal
		(and
			(solved A)
			(at hob G)
		)
	)
)

; plan
1. (wez hob f n10)
   deleted: (at n10 f)
   added: (have n10)
   goals met: 0 of 2
2. (idz hob f e n10)
   deleted: (at hob f) (have n10)
   added: (at hob e)
   goals met: 0 of 2
3. (wez hob e n7)
   deleted: (at n7 e)
   added: (have n7)
   goals met: 0 of 2
4. (wez hob e z8)
   deleted: (at z8 e)
   added: (have z8)
   goals met: 0 of 2
5. (idz hob e f n7)
   deleted: (at hob e) (have n7)
   added: (at hob f)
   goals met: 0 of 2
6. (wez hob f n9)
   deleted: (at n9 f)
   added: (have n9)
   goals met: 0 of 2
7. (idz hob f d z8)
   deleted: (at hob f) (have z8)
   added: (at hob d)
   goals met: 0 of 2
8. (wez hob d c6)
   deleted: (at c6 d)
   added: (have c6)
   goals met: 0 of 2
9. (wez hob d z5)
   deleted: (at z5 d)
   added: (have z5)
   goals met: 0 of 2
10. (idz hob d f z5)
   deleted: (at hob d) (have z5)
   added: (at hob f)
   goals met: 0 of 2
11. (idz hob f i n9)
   deleted: (at hob f) (have n9)
   added: (at hob i)
   goals met: 0 of 2
12. (wez hob i n14)
   deleted: (at n14 i)
   added: (have n14)
   goals met: 0 of 2
13. (wez hob i z13)
   deleted: (at z13 i)
   added: (have z13)
   goals met: 0 of 2
14. (idz hob i h n14)
   deleted: (at hob i) (have n14)
   added: (at hob h)
   goals met: 0 of 2
15. (wez hob h c12)
   deleted: (at c12 h)
   added: (have c12)
   goals met: 0 of 2
16. (wez hob h z11)
   deleted: (at z11 h)
   added: (have z11)
   goals met: 0 of 2
17. (idz hob h e c12)
   deleted: (at hob h) (have c12)
   added: (at hob e)
   goals met: 0 of 2
18. (idz hob e c z11)
   deleted: (at hob e) (have z11)
   added: (at hob c)
   goals met: 0 of 2
19. (wez hob c z3)
   deleted: (at z3 c)
   added: (have z3)
   goals met: 0 of 2
20. (idz hob c a c6)
   deleted: (at hob c) (have c6)
   added: (at hob a)
   goals met: 0 of 2
21. (wez hob a z1)
   deleted: (at z1 a)
   added: (have z1)
   goals met: 0 of 2
22. (ruszklocek hob a box8 box5 num2)
   deleted: (numbered box8 num2) (numbered box5 pusty)
   added: (numbered box8 pusty) (numbered box5 num2)
   goals met: 0 of 2
23. (ruszklocek hob a box9 box8 num6)
   deleted: (numbered box9 num6) (numbered box8 pusty)
   added: (numbered box9 pusty) (numbered box8 num6)
   goals met: 0 of 2
24. (ruszklocek hob a box6 box9 num3)
   deleted: (numbered box6 num3) (numbered box9 pusty)
   added: (numbered box6 pusty) (numbered box9 num3)
   goals met: 0 of 2
25. (ruszklocek hob a box5 box6 num2)
   deleted: (numbered box5 num2) (numbered box6 pusty)
   added: (numbered box5 pusty) (numbered box6 num2)
   goals met: 0 of 2
26. (ruszklocek hob a box4 box5 num8)
   deleted: (numbered box4 num8) (numbered box5 pusty)
   added: (numbered box4 pusty) (numbered box5 num8)
   goals met: 0 of 2
27. (ruszklocek hob a box1 box4 num5)
   deleted: (numbered box1 num5) (numbered box4 pusty)
   added: (numbered box1 pusty) (numbered box4 num5)
   goals met: 0 of 2
28. (ruszklocek hob a box2 box1 num4)
   deleted: (numbered box2 num4) (numbered box1 pusty)
   added: (numbered box2 pusty) (numbered box1 num4)
   goals met: 0 of 2
29. (ruszklocek hob a box3 box2 num1)
   deleted: (numbered box3 num1) (numbered box2 pusty)
   added: (numbered box3 pusty) (numbered box2 num1)
   goals met: 0 of 2
30. (ruszklocek hob a box6 box3 num2)
   deleted: (numbered box6 num2) (numbered box3 pusty)
   added: (numbered box6 pusty) (numbered box3 num2)
   goals met: 0 of 2
31. (ruszklocek hob a box9 box6 num3)
   deleted: (numbered box9 num3) (numbered box6 pusty)
   added: (numbered box9 pusty) (numbered box6 num3)
   goals met: 0 of 2
32. (ruszklocek hob a box8 box9 num6)
   deleted: (numbered box8 num6) (numbered box9 pusty)
   added: (numbered box8 pusty) (numbered box9 num6)
   goals met: 0 of 2
33. (ruszklocek hob a box5 box8 num8)
   deleted: (numbered box5 num8) (numbered box8 pusty)
   added: (numbered box5 pusty) (numbered box8 num8)
   goals met: 0 of 2
34. (ruszklocek hob a box4 box5 num5)
   deleted: (numbered box4 num5) (numbered box5 pusty)
   added: (numbered box4 pusty) (numbered box5 num5)
   goals met: 0 of 2
35. (ruszklocek hob a box1 box4 num4)
   deleted: (numbered box1 num4) (numbered box4 pusty)
   added: (numbered box1 pusty) (numbered box4 num4)
   goals met: 0 of 2
36. (ruszklocek hob a box2 box1 num1)
   deleted: (numbered box2 num1) (numbered box1 pusty)
   added: (numbered box2 pusty) (numbered box1 num1)
   goals met: 0 of 2
37. (ruszklocek hob a box3 box2 num2)
   deleted: (numbered box3 num2) (numbered box2 pusty)
   added: (numbered box3 pusty) (numbered box2 num2)
   goals met: 0 of 2
38. (ruszklocek hob a box6 box3 num3)
   deleted: (numbered box6 num3) (numbered box3 pusty)
   added: (numbered box6 pusty) (numbered box3 num3)
   goals met: 0 of 2
39. (ruszklocek hob a box9 box6 num6)
   deleted: (numbered box9 num6) (numbered box6 pusty)
   added: (numbered box9 pusty) (numbered box6 num6)
   goals met: 0 of 2
40. (rozwiaz hob a)
   deleted: (puzzle a)
   added: (solved a)
   goals met: 1 of 2
41. (idz hob a b z13)
   deleted: (at hob a) (have z13)
   added: (at hob b)
   goals met: 1 of 2
42. (wez hob b r2)
   deleted: (at r2 b)
   added: (have r2)
   goals met: 1 of 2
43. (idz hob b d z3)
   deleted: (at hob b) (have z3)
   added: (at hob d)
   goals met: 1 of 2
44. (idz hob d f z1)
   deleted: (at hob d) (have z1)
   added: (at hob f)
   goals met: 1 of 2
45. (idz hob f g r2)
   deleted: (at hob f) (have r2)
   added: (at hob g)
   goals met: 2 of 2
